lrmendes98/feup-semb/ESP8266_Multicast_Client/network.h
#ifndef _NETWORK_H
#define _NETWORK_H

#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include "user_interface.h"

#define SWITCH1_ID 1
#define SWITCH2_ID 2
#define SWITCH3_ID 3
#define SWITCH4_ID 4

#define BUFFER_LENGTH 256
char incomingPacket[BUFFER_LENGTH];

// local network settings
const char* ssid = "HUAWEI P10";
const char* password = "2072cac61e06";

// multicast settings
IPAddress multicastAddress(239, 0, 0, 1);
unsigned int multicastPort = 4444;
WiFiUDP Udp;

void setupNetwork() {
  WiFi.mode(WIFI_STA); //station
  wifi_set_sleep_type(NONE_SLEEP_T); //LIGHT_SLEEP_T and MODE_SLEEP_T
  Serial.print("Connecting to ");
  Serial.println(ssid);
  WiFi.begin(ssid, password);
  int i = 0;
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(1000);
    Serial.print(++i); Serial.print(' ');
  }
  Serial.println("Connection established!");
  Udp.beginMulticast(WiFi.localIP(), multicastAddress, multicastPort);
}

void receivePacket(int switches[]) {
  int packetLength = Udp.parsePacket();
  if (packetLength) {
    int len = Udp.read(incomingPacket, BUFFER_LENGTH);
    if (len > 0) {
      incomingPacket[len] = 0;
      Serial.print("Received: ");
      Serial.printf("%s\n", incomingPacket);
      int id;
      if (len == 1)
        id = (int)incomingPacket[0] - 48;
       else id = ((int)incomingPacket[0] - 48)*10 + ((int)incomingPacket[1] - 48);
      switches[id] = !switches[id];
    }
  }
}

void sendPacket(int id) {
  char msg = (char) id + 48;
  Serial.print("Sent: ");
  Serial.println(msg);
  Udp.beginPacketMulticast(multicastAddress, multicastPort, WiFi.localIP());
  Udp.write(msg);
  Udp.endPacket();
}

#endif
